const BUILDING_TEMPLATES = {

  "Шахта": {
    Вход: { "Питьевая вода": 50 },
    Выход: { "Руда": 300 },

    Эффективность: {
      base: 1.0,
      modifiers: [
        { if: { "Ландшафт": "Горы" }, value: 0.2 },
        { if: { "Экология.Загрязнение": { ">": 30 } }, value: -0.3 }
      ]
    },

    КритерииПровинции: {
      "Ландшафт": {
        "AND": ["Горы", { "OR": ["Лес", "Холмы"] }]
      },
      "Площадь": { ">=": 1000 }
    }
  },

  "Ферма": {
    Вход: {},
    Выход: { "Продовольствие": 500 },

    Эффективность: {
      base: 1.0,
      modifiers: [
        { if: { "Климат": "Умеренный" }, value: 0.2 }
      ]
    },

    КритерииПровинции: {
      "Аграрные земли": { ">=": 400 }
    }
  }

};